paper/get_set_benchmark/raw/redis-get-set-1-1.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1509138.11          ---          ---         5.42535         5.59900         6.39900         7.10300    114788.62 
Gets      1509138.11   1315497.58    193640.53         5.42535         5.59900         6.39900         7.10300    100991.58 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    3018276.23   1315497.58    193640.53         5.42535         5.59900         6.39900         7.10300    215780.20 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.031        0.000
SET       3.407        5.000
SET       4.927       10.000
SET       5.119       15.000
SET       5.215       20.000
SET       5.279       25.000
SET       5.343       30.000
SET       5.407       35.000
SET       5.471       40.000
SET       5.535       45.000
SET       5.599       50.000
SET       5.631       52.500
SET       5.631       55.000
SET       5.663       57.500
SET       5.695       60.000
SET       5.727       62.500
SET       5.759       65.000
SET       5.791       67.500
SET       5.823       70.000
SET       5.855       72.500
SET       5.887       75.000
SET       5.887       76.250
SET       5.887       77.500
SET       5.919       78.750
SET       5.919       80.000
SET       5.951       81.250
SET       5.951       82.500
SET       5.983       83.750
SET       5.983       85.000
SET       6.015       86.250
SET       6.047       87.500
SET       6.047       88.125
SET       6.047       88.750
SET       6.047       89.375
SET       6.079       90.000
SET       6.079       90.625
SET       6.079       91.250
SET       6.111       91.875
SET       6.111       92.500
SET       6.143       93.125
SET       6.143       93.750
SET       6.143       94.062
SET       6.175       94.375
SET       6.175       94.688
SET       6.175       95.000
SET       6.175       95.312
SET       6.207       95.625
SET       6.207       95.938
SET       6.207       96.250
SET       6.239       96.562
SET       6.239       96.875
SET       6.239       97.031
SET       6.271       97.188
SET       6.271       97.344
SET       6.271       97.500
SET       6.271       97.656
SET       6.303       97.812
SET       6.303       97.969
SET       6.303       98.125
SET       6.303       98.281
SET       6.335       98.438
SET       6.335       98.516
SET       6.335       98.594
SET       6.335       98.672
SET       6.367       98.750
SET       6.367       98.828
SET       6.367       98.906
SET       6.399       98.984
SET       6.399       99.062
SET       6.399       99.141
SET       6.431       99.219
SET       6.431       99.258
SET       6.431       99.297
SET       6.463       99.336
SET       6.463       99.375
SET       6.463       99.414
SET       6.495       99.453
SET       6.495       99.492
SET       6.495       99.531
SET       6.527       99.570
SET       6.559       99.609
SET       6.559       99.629
SET       6.559       99.648
SET       6.591       99.668
SET       6.591       99.688
SET       6.623       99.707
SET       6.655       99.727
SET       6.655       99.746
SET       6.687       99.766
SET       6.719       99.785
SET       6.783       99.805
SET       6.783       99.814
SET       6.815       99.824
SET       6.847       99.834
SET       6.879       99.844
SET       6.911       99.854
SET       6.943       99.863
SET       6.975       99.873
SET       7.007       99.883
SET       7.039       99.893
SET       7.103       99.902
SET       7.135       99.907
SET       7.167       99.912
SET       7.199       99.917
SET       7.231       99.922
SET       7.263       99.927
SET       7.327       99.932
SET       7.359       99.937
SET       7.423       99.941
SET       7.487       99.946
SET       7.551       99.951
SET       7.583       99.954
SET       7.647       99.956
SET       7.679       99.958
SET       7.743       99.961
SET       7.807       99.963
SET       7.871       99.966
SET       7.935       99.968
SET       8.031       99.971
SET       8.095       99.973
SET       8.191       99.976
SET       8.255       99.977
SET       8.319       99.978
SET       8.383       99.979
SET       8.447       99.980
SET       8.511       99.982
SET       8.575       99.983
SET       8.639       99.984
SET       8.703       99.985
SET       8.831       99.987
SET       8.959       99.988
SET       9.023       99.988
SET       9.087       99.989
SET       9.087       99.990
SET       9.151       99.990
SET       9.215       99.991
SET       9.279       99.991
SET       9.343       99.992
SET       9.407       99.993
SET       9.535       99.993
SET       9.663       99.994
SET       9.727       99.994
SET       9.791       99.995
SET       9.855       99.995
SET       9.983       99.995
SET      10.047       99.995
SET      10.111       99.996
SET      10.175       99.996
SET      10.239       99.996
SET      10.303       99.997
SET      10.367       99.997
SET      10.431       99.997
SET      10.495       99.997
SET      10.559       99.997
SET      10.559       99.998
SET      10.623       99.998
SET      10.687       99.998
SET      10.751       99.998
SET      10.751       99.998
SET      10.815       99.998
SET      10.879       99.998
SET      10.943       99.999
SET      10.943       99.999
SET      10.943       99.999
SET      11.007       99.999
SET      11.007       99.999
SET      11.007       99.999
SET      11.071       99.999
SET      11.071       99.999
SET      11.135       99.999
SET      11.135       99.999
SET      11.135       99.999
[...]
SET      11.199       99.999
SET      11.199       99.999
SET      11.199       99.999
[...]
SET      11.263      100.000
SET      11.263      100.000
SET      11.263      100.000
SET      11.327      100.000
SET      11.327      100.000
SET      11.327      100.000
[...]
SET      11.391      100.000
SET      11.391      100.000
SET      11.391      100.000
[...]
SET      11.455      100.000
SET      11.455      100.000
SET      11.455      100.000
[...]
SET      11.519      100.000
SET      11.519      100.000
---
GET       0.031        0.000
GET       3.407        5.000
GET       4.927       10.000
GET       5.119       15.000
GET       5.215       20.000
GET       5.279       25.000
GET       5.343       30.000
GET       5.407       35.000
GET       5.471       40.000
GET       5.535       45.000
GET       5.599       50.000
GET       5.631       52.500
GET       5.631       55.000
GET       5.663       57.500
GET       5.695       60.000
GET       5.727       62.500
GET       5.759       65.000
GET       5.791       67.500
GET       5.823       70.000
GET       5.855       72.500
GET       5.887       75.000
GET       5.887       76.250
GET       5.887       77.500
GET       5.919       78.750
GET       5.919       80.000
GET       5.951       81.250
GET       5.951       82.500
GET       5.983       83.750
GET       5.983       85.000
GET       6.015       86.250
GET       6.047       87.500
GET       6.047       88.125
GET       6.047       88.750
GET       6.047       89.375
GET       6.079       90.000
GET       6.079       90.625
GET       6.079       91.250
GET       6.111       91.875
GET       6.111       92.500
GET       6.143       93.125
GET       6.143       93.750
GET       6.143       94.062
GET       6.175       94.375
GET       6.175       94.688
GET       6.175       95.000
GET       6.175       95.312
GET       6.207       95.625
GET       6.207       95.938
GET       6.207       96.250
GET       6.239       96.562
GET       6.239       96.875
GET       6.239       97.031
GET       6.271       97.188
GET       6.271       97.344
GET       6.271       97.500
GET       6.271       97.656
GET       6.303       97.812
GET       6.303       97.969
GET       6.303       98.125
GET       6.303       98.281
GET       6.335       98.438
GET       6.335       98.516
GET       6.335       98.594
GET       6.335       98.672
GET       6.367       98.750
GET       6.367       98.828
GET       6.367       98.906
GET       6.399       98.984
GET       6.399       99.062
GET       6.399       99.141
GET       6.431       99.219
GET       6.431       99.258
GET       6.431       99.297
GET       6.463       99.336
GET       6.463       99.375
GET       6.463       99.414
GET       6.495       99.453
GET       6.495       99.492
GET       6.495       99.531
GET       6.527       99.570
GET       6.559       99.609
GET       6.559       99.629
GET       6.559       99.648
GET       6.591       99.668
GET       6.591       99.688
GET       6.623       99.707
GET       6.655       99.727
GET       6.655       99.746
GET       6.687       99.766
GET       6.719       99.785
GET       6.783       99.805
GET       6.783       99.814
GET       6.815       99.824
GET       6.847       99.834
GET       6.879       99.844
GET       6.911       99.854
GET       6.943       99.863
GET       6.975       99.873
GET       7.007       99.883
GET       7.039       99.893
GET       7.103       99.902
GET       7.135       99.907
GET       7.167       99.912
GET       7.199       99.917
GET       7.231       99.922
GET       7.263       99.927
GET       7.327       99.932
GET       7.359       99.937
GET       7.423       99.941
GET       7.487       99.946
GET       7.551       99.951
GET       7.583       99.954
GET       7.647       99.956
GET       7.679       99.958
GET       7.743       99.961
GET       7.807       99.963
GET       7.871       99.966
GET       7.935       99.968
GET       8.031       99.971
GET       8.095       99.973
GET       8.191       99.976
GET       8.255       99.977
GET       8.319       99.978
GET       8.383       99.979
GET       8.447       99.980
GET       8.511       99.982
GET       8.575       99.983
GET       8.639       99.984
GET       8.703       99.985
GET       8.831       99.987
GET       8.959       99.988
GET       9.023       99.988
GET       9.087       99.989
GET       9.087       99.990
GET       9.151       99.990
GET       9.215       99.991
GET       9.279       99.991
GET       9.343       99.992
GET       9.407       99.993
GET       9.535       99.993
GET       9.663       99.994
GET       9.727       99.994
GET       9.791       99.995
GET       9.855       99.995
GET       9.983       99.995
GET      10.047       99.995
GET      10.111       99.996
GET      10.175       99.996
GET      10.239       99.996
GET      10.303       99.997
GET      10.367       99.997
GET      10.431       99.997
GET      10.495       99.997
GET      10.559       99.997
GET      10.559       99.998
GET      10.623       99.998
GET      10.687       99.998
GET      10.751       99.998
GET      10.751       99.998
GET      10.815       99.998
GET      10.879       99.998
GET      10.943       99.999
GET      10.943       99.999
GET      10.943       99.999
GET      11.007       99.999
GET      11.007       99.999
GET      11.007       99.999
GET      11.071       99.999
GET      11.071       99.999
GET      11.135       99.999
GET      11.135       99.999
GET      11.135       99.999
[...]
GET      11.199       99.999
GET      11.199       99.999
GET      11.199       99.999
[...]
GET      11.263      100.000
GET      11.263      100.000
GET      11.263      100.000
GET      11.327      100.000
GET      11.327      100.000
GET      11.327      100.000
[...]
GET      11.391      100.000
GET      11.391      100.000
GET      11.391      100.000
[...]
GET      11.455      100.000
GET      11.455      100.000
GET      11.455      100.000
[...]
GET      11.519      100.000
GET      11.519      100.000
---
WAIT      0.000      100.000